Revit 2027 API
MEPFamilyConnectorInfo Class
 MEP family connector information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MEPConnectorInfo
 Autodesk.Revit.DB.MEPFamilyConnectorInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPFamilyConnectorInfo : MEPConnectorInfo
Public Class MEPFamilyConnectorInfo
	Inherits MEPConnectorInfo
public ref class MEPFamilyConnectorInfo : public MEPConnectorInfo
type MEPFamilyConnectorInfo =
    class
        inherit MEPConnectorInfo
    end
The MEPFamilyConnectorInfo type exposes the following members.
Properties
Name | Description
IsPrimary |  True if this is the primary connector.
(Inherited from MEPConnectorInfo)
IsSecondary |  True if this is the secondary connector.
(Inherited from MEPConnectorInfo)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from MEPConnectorInfo)
LinkedConnector |  The linked connector or null if there is no linked connector
(Inherited from MEPConnectorInfo)
Top
Methods
Name | Description
Dispose
(Inherited from MEPConnectorInfo)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAssociateFamilyParameterId |  Gets the associate family parameter id of the specified connector parameter id.
GetConnectorParameterValue |  Gets the parameter value of the specified connector parameter id.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace